<a href="https://colab.research.google.com/github/plthiyagu/AI-Engineering/blob/master/05-Python/Json_Load.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://www.kindsonthegenius.com/data-science/working-with-data-json-pandas-dataframe-with-python-useful-tipcs/

https://jsonplaceholder.typicode.com/todos

In [1]:
# How to import json in Python
import json

with open('todos.json') as f:
  data = json.load(f)

In [2]:
import pandas as pd
df = pd.DataFrame(columns=["name", "age", "height"])

In [3]:
df

Empty DataFrame
Columns: [name, age, height]
Index: []

3. Adding Rows to Pandas Dataframe

Adding Rows to Dataframe using loc[]

In [4]:
df.loc[0] = ["Kindson", 43, 80]
df.loc[1] = ["Jadon", 30, 170]
df.loc[2] = ["Solace", 14, 155]

In [5]:
df

      name age height
0  Kindson  43     80
1    Jadon  30    170
2   Solace  14    155

In [6]:
df.append({"name": "McMills", "age":14, "height": 74}, ignore_index=True)
df.append({"name": "Adaoma", "age":20, "height": 89}, ignore_index=True)

      name age height
0  Kindson  43     80
1    Jadon  30    170
2   Solace  14    155
3   Adaoma  20     89

In [7]:
from IPython.display import display

df[0:3, 0:3] – select first 3 rows and first 3 columns

df[0:3] – first 3 rows (0, 1, 2) and all the columns. Same as df[0:3,]

df[,0:3] – all the rows but first 3 columns

df[1: , 2:3] – row 1 to the last, but column 2 to3 (not inclusive)

In [9]:
df.iloc[0:3,0:3]

      name age height
0  Kindson  43     80
1    Jadon  30    170
2   Solace  14    155

In [10]:
df[0:3]

      name age height
0  Kindson  43     80
1    Jadon  30    170
2   Solace  14    155

In [11]:
df[,0:3]

SyntaxError: ignored